Tekla Open API Reference for Tekla Structures 2025
Polycurve Properties
The Polycurve type exposes the following members.
Properties
Name | Description
EndPoint
 Gets the end point of the polycurve
Length
 Gets the total length of the polycurve
StartPoint
 Gets the start point of the polycurve
Top
See Also
Reference
Polycurve Class
Tekla.Structures.Geometry3d Namespace